#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.lb_role.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.lb_role.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_workers: Reading...[0m[0m
[0m[1mmodule.lb_role.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_route53_zone.robopd2: Refreshing state... [id=Z024927025LNR9NP27L8C][0m
[0m[1maws_eip.main: Refreshing state... [id=eipalloc-024700ddd9d2b5cfd][0m
[0m[1maws_iam_role.eks_cluster: Refreshing state... [id=robopd2-eks-cluster][0m
[0m[1maws_vpc.robopd2_vpc: Refreshing state... [id=vpc-05056f5538a8ba48d][0m
[0m[1mmodule.lb_role.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.lb_role.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.assume_workers: Read complete after 0s [id=2851119427][0m
[0m[1maws_iam_role.eks_nodes: Refreshing state... [id=robopd2-eks-cluster-worker][0m
[0m[1mmodule.lb_role.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...[0m[0m
[0m[1mmodule.lb_role.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=1502806491][0m
[0m[1mmodule.lb_role.data.aws_caller_identity.current: Read complete after 0s [id=755302556834][0m
[0m[1mmodule.lb_role.aws_iam_policy.load_balancer_controller[0]: Refreshing state... [id=arn:aws:iam::755302556834:policy/AmazonEKS_AWS_Load_Balancer_Controller-20241105220336326300000002][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=755302556834][0m
[0m[1maws_iam_role_policy_attachment.aws_eks_cluster_policy: Refreshing state... [id=robopd2-eks-cluster-20241105220336748400000003][0m
[0m[1maws_iam_role_policy_attachment.ssm_access: Refreshing state... [id=robopd2-eks-cluster-worker-20241105220336833600000007][0m
[0m[1maws_iam_role_policy_attachment.ec2_read_only: Refreshing state... [id=robopd2-eks-cluster-worker-20241105220336831400000006][0m
[0m[1maws_iam_instance_profile.eks_nodes: Refreshing state... [id=robopd2-eks-cluster-worker-profile][0m
[0m[1maws_iam_role_policy_attachment.aws_eks_worker_node_policy: Refreshing state... [id=robopd2-eks-cluster-worker-20241105220336751200000004][0m
[0m[1maws_iam_role_policy_attachment.aws_eks_cni_policy: Refreshing state... [id=robopd2-eks-cluster-worker-20241105220336769300000005][0m
[0m[1maws_subnet.public_subnet: Refreshing state... [id=subnet-0441c74696bc2ec42][0m
[0m[1maws_security_group.eks_nodes: Refreshing state... [id=sg-05897810e8a7b106e][0m
[0m[1maws_security_group.control_plane_sg: Refreshing state... [id=sg-0e40d8e797889e89b][0m
[0m[1maws_internet_gateway.igw: Refreshing state... [id=igw-0aae66ddb96b61bd3][0m
[0m[1maws_security_group.eks_cluster: Refreshing state... [id=sg-08244083dbb2c0d7b][0m
[0m[1maws_subnet.private_subnet[0]: Refreshing state... [id=subnet-00997ae884294f6d5][0m
[0m[1maws_security_group.data_plane_sg: Refreshing state... [id=sg-06f7883b1e6c674d4][0m
[0m[1maws_subnet.private_subnet[1]: Refreshing state... [id=subnet-07e25021ea5478952][0m
[0m[1maws_security_group.public_sg: Refreshing state... [id=sg-0db134eca90a6c5ad][0m
[0m[1maws_security_group_rule.control_plane_outbound: Refreshing state... [id=sgrule-887774520][0m
[0m[1maws_security_group_rule.control_plane_inbound: Refreshing state... [id=sgrule-3745396397][0m
[0m[1maws_nat_gateway.main: Refreshing state... [id=nat-0e5585ea22447b850][0m
[0m[1maws_security_group_rule.sg_egress_public: Refreshing state... [id=sgrule-3651849889][0m
[0m[1maws_security_group_rule.sg_ingress_public_443: Refreshing state... [id=sgrule-3630823271][0m
[0m[1maws_security_group_rule.sg_ingress_public_80: Refreshing state... [id=sgrule-1029990495][0m
[0m[1maws_security_group_rule.cluster_inbound: Refreshing state... [id=sgrule-4254995020][0m
[0m[1maws_security_group_rule.cluster_outbound: Refreshing state... [id=sgrule-2332895347][0m
[0m[1maws_security_group_rule.node_outbound: Refreshing state... [id=sgrule-338177923][0m
[0m[1maws_security_group_rule.nodes: Refreshing state... [id=sgrule-2778307756][0m
[0m[1maws_security_group_rule.nodes_inbound: Refreshing state... [id=sgrule-3676854405][0m
[0m[1maws_eks_cluster.main: Refreshing state... [id=robopd2-eks-cluster][0m
[0m[1maws_route_table.main: Refreshing state... [id=rtb-0a49e1d0a6cde0661][0m
[0m[1maws_route.main: Refreshing state... [id=r-rtb-0d53bcdeb93eb3faa1080289494][0m
[0m[1maws_route_table_association.internet_access: Refreshing state... [id=rtbassoc-09c9a3055f2819445][0m
[0m[1mdata.aws_eks_cluster.main: Reading...[0m[0m
[0m[1maws_eks_node_group.main: Refreshing state... [id=robopd2-eks-cluster:robopd2-node-group][0m
[0m[1mdata.aws_eks_cluster.main: Read complete after 0s [id=robopd2-eks-cluster][0m
[0m[1mdata.aws_eks_cluster_auth.main: Reading...[0m[0m
[0m[1mdata.external.thumb: Reading...[0m[0m
[0m[1mmodule.lb_role.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mdata.aws_eks_cluster_auth.main: Read complete after 0s [id=robopd2-eks-cluster][0m
[0m[1mmodule.lb_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=804756236][0m
[0m[1mmodule.lb_role.aws_iam_role.this[0]: Refreshing state... [id=robopd2_eks_lb][0m
[0m[1mdata.external.thumb: Read complete after 0s [id=-][0m
[0m[1maws_iam_openid_connect_provider.default: Refreshing state... [id=arn:aws:iam::755302556834:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/26C4A2E91EE813B47953D996CA84FE0E][0m
[0m[1mmodule.lb_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=robopd2_eks_lb-2024110522143922810000000b][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # helm_release.aws_load_balancer_controller[0m will be created
[0m  [32m+[0m[0m resource "helm_release" "aws_load_balancer_controller" {
      [32m+[0m[0m atomic                     = false
      [32m+[0m[0m chart                      = "aws-load-balancer-controller"
      [32m+[0m[0m cleanup_on_fail            = false
      [32m+[0m[0m create_namespace           = false
      [32m+[0m[0m dependency_update          = false
      [32m+[0m[0m disable_crd_hooks          = false
      [32m+[0m[0m disable_openapi_validation = false
      [32m+[0m[0m disable_webhooks           = false
      [32m+[0m[0m force_update               = false
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m lint                       = false
      [32m+[0m[0m manifest                   = (known after apply)
      [32m+[0m[0m max_history                = 0
      [32m+[0m[0m metadata                   = (known after apply)
      [32m+[0m[0m name                       = "robopd2-eks-alb-ingress-controller"
      [32m+[0m[0m namespace                  = "kube-system"
      [32m+[0m[0m pass_credentials           = false
      [32m+[0m[0m recreate_pods              = false
      [32m+[0m[0m render_subchart_notes      = true
      [32m+[0m[0m replace                    = false
      [32m+[0m[0m repository                 = "https://aws.github.io/eks-charts"
      [32m+[0m[0m reset_values               = false
      [32m+[0m[0m reuse_values               = false
      [32m+[0m[0m skip_crds                  = false
      [32m+[0m[0m status                     = "deployed"
      [32m+[0m[0m timeout                    = 300
      [32m+[0m[0m verify                     = false
      [32m+[0m[0m version                    = "1.10.0"
      [32m+[0m[0m wait                       = true
      [32m+[0m[0m wait_for_jobs              = false

      [32m+[0m[0m set {
          [32m+[0m[0m name  = "clusterName"
          [32m+[0m[0m value = "robopd2-eks-cluster"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "region"
          [32m+[0m[0m value = "us-east-1"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "serviceAccount.create"
          [32m+[0m[0m value = "true"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "serviceAccount.name"
          [32m+[0m[0m value = "aws-load-balancer-controller"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [32m+[0m[0m set {
          [32m+[0m[0m name  = "vpcId"
          [32m+[0m[0m value = "vpc-05056f5538a8ba48d"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: /home/cameron/tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/cameron/tfplan.out"

```

</details>
*Pushed by: @cameronrosier, Action: `pull_request`*